app/controllers/posts_controller.rb

	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))#title: params[:title], description: params[:description])
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2015-12-31 21:17:16.238910"], ["id", 3]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]